fixtures/better-auth/jwt/db/schema.dbml
Table user {
  id text [pk, note: 'Primary key']
  name text [note: 'name']
  email text [note: 'email']
  emailVerified boolean [note: 'emailVerified']
  image text [note: 'image']
  createdAt timestamp [note: 'createdAt']
  updatedAt timestamp [note: 'updatedAt']
}

Table session {
  id text [pk, note: 'Primary key']
  expiresAt timestamp [note: 'expiresAt']
  token text [note: 'token']
  createdAt timestamp [note: 'createdAt']
  updatedAt timestamp [note: 'updatedAt']
  ipAddress text [note: 'ipAddress']
  userAgent text [note: 'userAgent']
  userId text [note: 'userId']
}

Table account {
  id text [pk, note: 'Primary key']
  accountId text [note: 'accountId']
  providerId text [note: 'providerId']
  userId text [note: 'userId']
  accessToken text [note: 'accessToken']
  refreshToken text [note: 'refreshToken']
  idToken text [note: 'idToken']
  accessTokenExpiresAt timestamp [note: 'accessTokenExpiresAt']
  refreshTokenExpiresAt timestamp [note: 'refreshTokenExpiresAt']
  scope text [note: 'scope']
  password text [note: 'password']
  createdAt timestamp [note: 'createdAt']
  updatedAt timestamp [note: 'updatedAt']
}

Table verification {
  id text [pk, note: 'Primary key']
  identifier text [note: 'identifier']
  value text [note: 'value']
  expiresAt timestamp [note: 'expiresAt']
  createdAt timestamp [note: 'createdAt']
  updatedAt timestamp [note: 'updatedAt']
}

Table jwks {
  id text [pk, note: 'Primary key']
  publicKey text [note: 'publicKey']
  privateKey text [note: 'privateKey']
  createdAt timestamp [note: 'createdAt']
  expiresAt timestamp [note: 'expiresAt']
}

Ref session_userId_user_id_fk: session.userId > user.id

Ref account_userId_user_id_fk: account.userId > user.id
